perf/exchange-endurance.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 250

  phases:
    - name: Warmup
      duration: 120
      arrivalRate: 5
      rampTo: 20
    - name: Sustained load
      duration: 1800
      arrivalRate: 1500
    - name: Cooldown
      duration: 120
      arrivalRate: 5

scenarios:
  - name: Buy USD/ARS
    weight: 55
    flow:
      - post:
          url: '/exchange'
          headers:
            Content-Type: application/json
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            baseAmount: 5
            baseAccountId: 11
            counterAccountId: 10

  - name: Sell ARS/USD
    weight: 45
    flow:
      - post:
          url: '/exchange'
          headers:
            Content-Type: application/json
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAmount: 7000
            baseAccountId: 10
            counterAccountId: 11