perf/exchange-load-scaled.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: artillery-api
  pool: 250
  phases:
    - name: Warmup
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: Ramp to high load
      duration: 120
      arrivalRate: 20
      rampTo: 60
    - name: Sustained high load
      duration: 180
      arrivalRate: 60
scenarios:
  - name: Buy USD/ARS nginx-1
    weight: 55
    flow:
      - post:
          url: 'http://localhost:5555/exchange'
          headers:
            Content-Type: application/json
          json:
            baseCurrency: USD
            counterCurrency: ARS
            baseAmount: 5
            baseAccountId: 11
            counterAccountId: 10
  - name: Sell ARS/USD nginx-1
    weight: 45
    flow:
      - post:
          url: 'http://localhost:5555/exchange'
          headers:
            Content-Type: application/json
          json:
            baseCurrency: ARS
            counterCurrency: USD
            baseAmount: 7000
            baseAccountId: 10
            counterAccountId: 11
  - name: Buy USD/ARS nginx-2
    weight: 55
    flow:
      - post:
          url: 'http://localhost:5556/exchange'
          headers:
            Content-Type: application/json
          json:
            baseCurrency: USD
            counterCurrency: ARS
            baseAmount: 5
            baseAccountId: 11
            counterAccountId: 10
  - name: Sell ARS/USD nginx-2
    weight: 45
    flow:
      - post:
          url: 'http://localhost:5556/exchange'
          headers:
            Content-Type: application/json
          json:
            baseCurrency: ARS
            counterCurrency: USD
            baseAmount: 7000
            baseAccountId: 10
            counterAccountId: 11
  - name: Buy USD/ARS nginx-3
    weight: 55
    flow:
      - post:
          url: 'http://localhost:5557/exchange'
          headers:
            Content-Type: application/json
          json:
            baseCurrency: USD
            counterCurrency: ARS
            baseAmount: 5
            baseAccountId: 11
            counterAccountId: 10
  - name: Sell ARS/USD nginx-3
    weight: 45
    flow:
      - post:
          url: 'http://localhost:5557/exchange'
          headers:
            Content-Type: application/json
          json:
            baseCurrency: ARS
            counterCurrency: USD
            baseAmount: 7000
            baseAccountId: 10
            counterAccountId: 11